Optify-Oberflaechen/Files/request_giblieferant.xml

<?xml version="1.0" encoding="UTF-8"?>
	<!-- Generiert mit dem WSDL2B4A-Generator Version 1.1 und unter GPL 3 zur Verfuegung gestellt.-->
	<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
		<s:Body>
			<gibLieferant xmlns="http://tempuri.org/">
				<pBen>
					<BenutzerID xmlns="http://schemas.datacontract.org/2004/07/Optify">$PBEN_BENUTZERID$</BenutzerID>
					<Benutzername xmlns="http://schemas.datacontract.org/2004/07/Optify">$PBEN_BENUTZERNAME$</Benutzername>
					<Name xmlns="http://schemas.datacontract.org/2004/07/Optify">$PBEN_NAME$</Name>
					<Passwort xmlns="http://schemas.datacontract.org/2004/07/Optify">$PBEN_PASSWORT$</Passwort>
					<Typ xmlns="http://schemas.datacontract.org/2004/07/Optify">$PBEN_TYP$</Typ>
					<Vorname xmlns="http://schemas.datacontract.org/2004/07/Optify">$PBEN_VORNAME$</Vorname>
				</pBen>
			</gibLieferant>
		</s:Body>
	</s:Envelope>
